КИСП/Курсовая/Greg/tools/fill-data/build/cfg-dump/Documents/ВыводЗалаИзЭксплуатации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ВыводЗалаИзЭксплуатации</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИсторияСтатусовЗалов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Кинозалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Кинозал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Кинозалы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

КИСП/Курсовая/Greg/tools/fill-data/build/cfg-dump/Enums/СтатусыЗалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыЗалов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Свободен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Забронирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Занят</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обслуживание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

КИСП/Курсовая/Greg/tools/fill-data/build/cfg-dump/Documents/ВыводЗалаИзЭксплуатации/Ext/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Для Каждого СтрокаТЧ Из Кинозалы Цикл
		Если СтрокаТЧ.Кинозал.Состояние = Перечисления.СостоянияЗалов.Закрыт Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Кинозал """ + Строка(СтрокаТЧ.Кинозал) + """ уже закрыт!";
			Сообщение.Поле = "Кинозалы[" + (СтрокаТЧ.НомерСтроки - 1) + "].Кинозал";
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Для Каждого СтрокаТЧ Из Кинозалы Цикл
		Движение = Движения.ИсторияСтатусовЗалов.Добавить();
		Движение.Период = Дата;
		Движение.Кинозал = СтрокаТЧ.Кинозал;
		Движение.Статус = Перечисления.СтатусыЗалов.Закрыт;
		
		ЗалОбъект = СтрокаТЧ.Кинозал.ПолучитьОбъект();
		ЗалОбъект.Состояние = Перечисления.СостоянияЗалов.Закрыт;
		ЗалОбъект.Записать();
	КонецЦикла;
КонецПроцедуры
